app/Providers/FortifyServiceProvider.php

    public function boot()
    {
        Fortify::authenticateUsing(function (Request $request) {
            $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'salahhusa9@gmail.com' limit 1