app/Http/Controllers/admin/UserController.php

select * from `roles`
select * from `stocks`
---
    public function list()
    {
        $pageConfigs = ['pageHeader' => false];
        $roles = Role::all();
        $stocks = Stock::all();

select `status` as `value` from `users` group by `status`
---
    public function api()
    {
        $model = User::with('roles');
        return \DataTables::eloquent($model)->with([
            'filter_status' => User::select('status as value')->groupBy('status')->get(),
        ])
            ->toJson();